MCUdude/MightyCore/avr/boards.txt
1284.menu.clock.1MHz_internal=1 MHz internal
1284.menu.clock.1MHz_internal.upload.port=UART0
1284.menu.clock.1MHz_internal.upload.speed=9600
1284.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1284.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
1284.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
1284.menu.clock.1MHz_internal.build.f_cpu=1000000L



###########################
#### ATmega644/A/P/PA  ####
###########################

644.name=ATmega644
644.upload.tool=avrdude
644.upload.protocol=arduino
644.upload.maximum_size=64512
644.upload.maximum_data_size=4096

644.bootloader.tool=avrdude
644.bootloader.unlock_bits=0x3f
644.bootloader.lock_bits=0x0f

644.build.core=MCUdude_corefiles
644.build.board=AVR_ATmega644

# Pinouts
644.menu.pinout.standard=Standard
644.menu.pinout.standard.build.variant=standard
644.menu.pinout.bobuino=Bobuino
644.menu.pinout.bobuino.build.variant=bobuino
644.menu.pinout.sanguino=Sanguino
644.menu.pinout.sanguino.build.variant=sanguino

# Variants
644.menu.variant.modelP=644P / 644PA
644.menu.variant.modelP.build.mcu=atmega644p
644.menu.variant.modelA=644 / 644A
644.menu.variant.modelA.build.mcu=atmega644

# Brown out detection
644.menu.BOD.2v7=2.7v
644.menu.BOD.2v7.bootloader.extended_fuses=0xfb
644.menu.BOD.4v3=4.3v
644.menu.BOD.4v3.bootloader.extended_fuses=0xf9
644.menu.BOD.1v8=1.8v
644.menu.BOD.1v8.bootloader.extended_fuses=0xfd
644.menu.BOD.disabled=Disabled
644.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
644.menu.LTO.Os=Disabled (default)
644.menu.LTO.Os.compiler.c.extra_flags=
644.menu.LTO.Os.compiler.c.elf.extra_flags=
644.menu.LTO.Os.compiler.cpp.extra_flags=
644.menu.LTO.Os.ltoarcmd=avr-ar

644.menu.LTO.Os_flto=Enabled
644.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
644.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
644.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
644.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
644.menu.clock.16MHz_external=16 MHz external
644.menu.clock.16MHz_external.upload.port=UART0
644.menu.clock.16MHz_external.upload.speed=115200
644.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
644.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.16MHz_external.build.f_cpu=16000000L

644.menu.clock.20MHz_external=20 MHz external
644.menu.clock.20MHz_external.upload.port=UART0
644.menu.clock.20MHz_external.upload.speed=115200
644.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
644.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.20MHz_external.build.f_cpu=20000000L

644.menu.clock.18_432MHz_external=18.432 MHz external
644.menu.clock.18_432MHz_external.upload.port=UART0
644.menu.clock.18_432MHz_external.upload.speed=115200
644.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
644.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.18_432MHz_external.build.f_cpu=18432000L

644.menu.clock.12MHz_external=12 MHz external
644.menu.clock.12MHz_external.upload.port=UART0
644.menu.clock.12MHz_external.upload.speed=57600
644.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
644.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.12MHz_external.build.f_cpu=12000000L

644.menu.clock.8MHz_external=8 MHz external
644.menu.clock.8MHz_external.upload.port=UART0
644.menu.clock.8MHz_external.upload.speed=57600
644.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
644.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
644.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.8MHz_external.build.f_cpu=8000000L

644.menu.clock.8MHz_internal=8 MHz internal
644.menu.clock.8MHz_internal.upload.port=UART0
644.menu.clock.8MHz_internal.upload.speed=38400
644.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
644.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
644.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.8MHz_internal.build.f_cpu=8000000L

644.menu.clock.1MHz_internal=1 MHz internal
644.menu.clock.1MHz_internal.upload.port=UART0
644.menu.clock.1MHz_internal.upload.speed=9600
644.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
644.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
644.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
644.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
#### ATmega324A/P/PA  ####
##########################

324.name=ATmega324
324.upload.tool=avrdude
324.upload.protocol=arduino
324.upload.maximum_size=32256
324.upload.maximum_data_size=2048

324.bootloader.tool=arduino:avrdude
324.bootloader.unlock_bits=0x3f
324.bootloader.lock_bits=0x0f

324.build.core=MCUdude_corefiles
324.build.board=AVR_ATmega324

# Pinouts
324.menu.pinout.standard=Standard
324.menu.pinout.standard.build.variant=standard
324.menu.pinout.bobuino=Bobuino
324.menu.pinout.bobuino.build.variant=bobuino
324.menu.pinout.sanguino=Sanguino
324.menu.pinout.sanguino.build.variant=sanguino

