MCUdude/MightyCore/avr/boards.txt
# Clock frequencies
164.menu.clock.16MHz_external=16 MHz external
164.menu.clock.16MHz_external.upload.port=UART0
164.menu.clock.16MHz_external.upload.speed=115200
164.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.16MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.16MHz_external.build.f_cpu=16000000L

164.menu.clock.20MHz_external=20 MHz external
164.menu.clock.20MHz_external.upload.port=UART0
164.menu.clock.20MHz_external.upload.speed=115200
164.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.20MHz_external.build.f_cpu=20000000L

164.menu.clock.18_432MHz_external=18.432 MHz external
164.menu.clock.18_432MHz_external.upload.port=UART0
164.menu.clock.18_432MHz_external.upload.speed=115200
164.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.18_432MHz_external.build.f_cpu=18432000L

164.menu.clock.12MHz_external=12 MHz external
164.menu.clock.12MHz_external.upload.port=UART0
164.menu.clock.12MHz_external.upload.speed=57600
164.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.12MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.12MHz_external.build.f_cpu=12000000L

164.menu.clock.8MHz_external=8 MHz external
164.menu.clock.8MHz_external.upload.port=UART0
164.menu.clock.8MHz_external.upload.speed=57600
164.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.8MHz_external.bootloader.high_fuses=0xd4
164.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.8MHz_external.build.f_cpu=8000000L

164.menu.clock.8MHz_internal=8 MHz internal
164.menu.clock.8MHz_internal.upload.port=UART0
164.menu.clock.8MHz_internal.upload.speed=38400
164.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
164.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.8MHz_internal.build.f_cpu=8000000L

164.menu.clock.1MHz_internal=1 MHz internal
164.menu.clock.1MHz_internal.upload.port=UART0
164.menu.clock.1MHz_internal.upload.speed=9600
164.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
164.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
164.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
164.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega32/A  ####
#####################

32.name=ATmega32
32.upload.tool=avrdude
32.upload.protocol=arduino
32.upload.maximum_size=32256
32.upload.maximum_data_size=2048

32.bootloader.tool=avrdude
32.bootloader.unlock_bits=0x3f
32.bootloader.lock_bits=0x0f
32.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}

32.build.mcu=atmega32
32.build.core=MCUdude_corefiles
32.build.board=AVR_ATmega32

# Pinouts
32.menu.pinout.standard=Standard
32.menu.pinout.standard.build.variant=standard
32.menu.pinout.bobuino=Bobuino
32.menu.pinout.bobuino.build.variant=bobuino
32.menu.pinout.sanguino=Sanguino
32.menu.pinout.sanguino.build.variant=sanguino

# Brown out detection - This is the first part of the low fuse bit concatenation
32.menu.BOD.2v7=2.7v
32.menu.BOD.2v7.bootloader.bod_bits=10
32.menu.BOD.4v0=4.0v
32.menu.BOD.4v0.bootloader.bod_bits=00
32.menu.BOD.disabled=Disabled
32.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
32.menu.LTO.Os=Disabled (default)
32.menu.LTO.Os.compiler.c.extra_flags=
32.menu.LTO.Os.compiler.c.elf.extra_flags=
32.menu.LTO.Os.compiler.cpp.extra_flags=
32.menu.LTO.Os.ltoarcmd=avr-ar

32.menu.LTO.Os_flto=Enabled
32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
32.menu.clock.16MHz_external=16 MHz external
32.menu.clock.16MHz_external.upload.port=UART0
32.menu.clock.16MHz_external.upload.speed=115200
32.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.16MHz_external.bootloader.high_fuses=0xc6
32.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.16MHz_external.build.f_cpu=16000000L

32.menu.clock.20MHz_external=20 MHz external
32.menu.clock.20MHz_external.upload.port=UART0
32.menu.clock.20MHz_external.upload.speed=115200
32.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.20MHz_external.bootloader.high_fuses=0xc6
32.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.20MHz_external.build.f_cpu=20000000L

32.menu.clock.18_432MHz_external=18.432 MHz external
32.menu.clock.18_432MHz_external.upload.port=UART0
32.menu.clock.18_432MHz_external.upload.speed=115200
32.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.18_432MHz_external.bootloader.high_fuses=0xc6
32.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

