MCUdude/MightyCore/avr/boards.txt
32.menu.clock.12MHz_external=12 MHz external
32.menu.clock.12MHz_external.upload.port=UART0
32.menu.clock.12MHz_external.upload.speed=57600
32.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.12MHz_external.bootloader.high_fuses=0xc6
32.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.12MHz_external.build.f_cpu=12000000L

32.menu.clock.8MHz_external=8 MHz external
32.menu.clock.8MHz_external.upload.port=UART0
32.menu.clock.8MHz_external.upload.speed=57600
32.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.8MHz_external.bootloader.high_fuses=0xc6
32.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.8MHz_external.build.f_cpu=8000000L

32.menu.clock.8MHz_internal=8 MHz internal
32.menu.clock.8MHz_internal.upload.port=UART0
32.menu.clock.8MHz_internal.upload.speed=38400
32.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
32.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
32.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

32.menu.clock.1MHz_internal=1 MHz internal
32.menu.clock.1MHz_internal.upload.port=UART0
32.menu.clock.1MHz_internal.upload.speed=9600
32.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
32.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
32.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega16/A  ####
#####################

16.name=ATmega16
16.upload.tool=avrdude
16.upload.protocol=arduino
16.upload.maximum_size=15872
16.upload.maximum_data_size=1024

16.bootloader.tool=avrdude
16.bootloader.unlock_bits=0x3f
16.bootloader.lock_bits=0x0f
16.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}


16.build.mcu=atmega16
16.build.core=MCUdude_corefiles
16.build.board=AVR_ATmega16

# Pinouts
16.menu.pinout.standard=Standard
16.menu.pinout.standard.build.variant=standard
16.menu.pinout.bobuino=Bobuino
16.menu.pinout.bobuino.build.variant=bobuino
16.menu.pinout.sanguino=Sanguino
16.menu.pinout.sanguino.build.variant=sanguino

# Brown out detection - This is the first part of the low fuse bit concatenation
16.menu.BOD.2v7=2.7v
16.menu.BOD.2v7.bootloader.bod_bits=10
16.menu.BOD.4v0=4.0v
16.menu.BOD.4v0.bootloader.bod_bits=00
16.menu.BOD.disabled=Disabled
16.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
16.menu.LTO.Os=Disabled (default)
16.menu.LTO.Os.compiler.c.extra_flags=
16.menu.LTO.Os.compiler.c.elf.extra_flags=
16.menu.LTO.Os.compiler.cpp.extra_flags=
16.menu.LTO.Os.ltoarcmd=avr-ar

16.menu.LTO.Os_flto=Enabled
16.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
16.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
16.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
16.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar


# Clock frequencies - This is the second part of the low fuse bit concatenation
16.menu.clock.16MHz_external=16 MHz external
16.menu.clock.16MHz_external.upload.port=UART0
16.menu.clock.16MHz_external.upload.speed=115200
16.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.16MHz_external.bootloader.high_fuses=0xc4
16.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.16MHz_external.build.f_cpu=16000000L

16.menu.clock.20MHz_external=20 MHz external
16.menu.clock.20MHz_external.upload.port=UART0
16.menu.clock.20MHz_external.upload.speed=115200
16.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.20MHz_external.bootloader.high_fuses=0xc4
16.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.20MHz_external.build.f_cpu=20000000L

16.menu.clock.18_432MHz_external=18.432 MHz external
16.menu.clock.18_432MHz_external.upload.port=UART0
16.menu.clock.18_432MHz_external.upload.speed=115200
16.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.18_432MHz_external.bootloader.high_fuses=0xc4
16.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.18_432MHz_external.build.f_cpu=18432000L

16.menu.clock.12MHz_external=12 MHz external
16.menu.clock.12MHz_external.upload.port=UART0
16.menu.clock.12MHz_external.upload.speed=57600
16.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.12MHz_external.bootloader.high_fuses=0xc4
16.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.12MHz_external.build.f_cpu=12000000L

16.menu.clock.8MHz_external=8 MHz external
16.menu.clock.8MHz_external.upload.port=UART0
16.menu.clock.8MHz_external.upload.speed=115200
16.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.8MHz_external.bootloader.high_fuses=0xc4
16.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.8MHz_external.build.f_cpu=8000000L

16.menu.clock.8MHz_internal=8 MHz internal
16.menu.clock.8MHz_internal.upload.port=UART0
16.menu.clock.8MHz_internal.upload.speed=38400
16.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
16.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
16.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.8MHz_internal.build.f_cpu=8000000L

16.menu.clock.1MHz_internal=1 MHz internal
16.menu.clock.1MHz_internal.upload.port=UART0
16.menu.clock.1MHz_internal.upload.speed=9600
16.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
16.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
16.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
16.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega8535  ####
#####################

8535.name=ATmega8535
8535.upload.tool=avrdude
8535.upload.protocol=arduino
8535.upload.maximum_size=7680
8535.upload.maximum_data_size=512

8535.bootloader.tool=avrdude
8535.bootloader.unlock_bits=0x3f
8535.bootloader.lock_bits=0x0f
8535.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}

8535.build.mcu=atmega8535
8535.build.core=MCUdude_corefiles
8535.build.board=AVR_ATmega8535

# Pinouts
8535.menu.pinout.standard=Standard
8535.menu.pinout.standard.build.variant=standard
8535.menu.pinout.bobuino=Bobuino
8535.menu.pinout.bobuino.build.variant=bobuino
8535.menu.pinout.sanguino=Sanguino
8535.menu.pinout.sanguino.build.variant=sanguino

